#+TITLE: Config

*** LaTeX
#+begin_src emacs-lisp
;; (after! org
;;   (setq org-latex-classes '("article"
;;                  "\\documentclass[11pt,a4paper]{article}
;; \\usepackage[utf8]{inputenc}
;; \\usepackage[T1]{fontenc}
;; \\usepackage{fixltx2e}
;; \\usepackage{graphicx}
;; \\usepackage{longtable}
;; \\usepackage{float}
;; \\usepackage{wrapfig}
;; \\usepackage{rotating}
;; \\usepackage[normalem]{ulem}
;; \\usepackage{amsmath}
;; \\usepackage{textcomp}
;; \\usepackage{marvosym}
;; \\usepackage{wasysym}
;; \\usepackage{amssymb}
;; \\usepackage{hyperref}
;; \\usepackage{mathpazo}
;; \\usepackage{color}
;; \\usepackage{enumerate}
;; \\definecolor{bg}{rgb}{0.95,0.95,0.95}
;; \\tolerance=1000
;;       [NO-DEFAULT-PACKAGES]
;;       [PACKAGES]
;;       [EXTRA]
;; \\linespread{1.1}
;; \\hypersetup{pdfborder=0 0 0}"
;;                  ("\\section{%s}" . "\\section*{%s}")
;;                  ("\\subsection{%s}" . "\\subsection*{%s}")
;;                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
;;                  ("\\paragraph{%s}" . "\\paragraph*{%s}"))))
#+end_src

#+RESULTS:
#+begin_example
(article \documentclass[11pt,a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\usepackage{mathpazo}
\usepackage{color}
\usepackage{enumerate}
\definecolor{bg}{rgb}{0.95,0.95,0.95}
\tolerance=1000
      [NO-DEFAULT-PACKAGES]
      [PACKAGES]
      [EXTRA]
\linespread{1.1}
\hypersetup{pdfborder=0 0 0} (\section{%s} . \section*{%s}) (\subsection{%s} . \subsection*{%s}) (\subsubsection{%s} . \subsubsection*{%s}) (\paragraph{%s} . \paragraph*{%s}))
#+end_example


Load org-fragtog for live Latex previews
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
#+end_src

Load org-modern for nice looking org documents
#+begin_src emacs-lisp
;; (add-hook 'org-mode-hook #'org-modern-mode)
#+end_src

